---
kind: other
id: Methods.T:Autodesk.Revit.DB.MEPCurve
source: html/86b7136e-94b2-2e16-b26b-d0bb85479a2a.htm
---
# MEPCurve Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.